<h3>افزودن گروهی کاربر</h3>

<?= $this->Form->create(null,[
    'type'=>'file',
    'url'=>['plugin'=>'Admin','controller'=>'Users','action'=>'add','?'=>['get'=>'group']],
    'class'=>'col-sm-12']) ?>
<div class="row tab-content" style="padding:20px 0;">
    <div class="col-sm-6">
        <?=$this->Form->control('file', 
            ['class'=>'form-control mb-3','type'=>'file','label'=>'فایل CSV را انتخاب کنید']);?>
    </div>
    <div class="col-sm-6">
        - دانلود فایل نمونه [<?=$this->html->link('کلیک کنید','/lms/files/user_group.zip')?>]<br>
        - اولین ستون همیشه نام کاربری باشد<br>
        - توجه داشته باشید که نام کاربری کمتر از 8 کاراکتر نباشد و اطلاعاتی از قبیل نام کاربری یا آدرس ایمیل تکراری نباشند<br>
        - انکودینک فایل  میبایست UTF-8 باشد . در غیر این صورت ممکن است متن های فارسی درست ذخیره نشوند<bR>
        - باتوجه به عنوان ستون ها، اطلاعات را وارد کنید<br>
        - در صورتی که نام کاربری تکراری باشد و یا پسورد کوتاه باشد، سطر ذخیره نخواهد شد.<br><br>
        - برای تغییر فایل میتوانید از Notepad استفاده نمایید<br>
        - پسوند فایل میبایست CSV باشد. پسوند Xls یا Xlsx قابل استفاده نمی باشد<br>
        - از قرار دادن کاراکتر های غیرمجاز یا ... اجتناب کنید<br>
        - در اطلاعات وارد شده از کاراکتر نقطه ویرگول "<b>;</b>" استفاده نکنید
    </div>
</div>

<?= $this->Form->button(__('ثبت اطلاعات'),['class'=>'mt-3 mb-3 btn btn-sm btn-success']);?>
<?= $this->Form->end() ?>